# Module 3: Data Selection and Filtering
    
## Objective:
Learn how to select, filter, and manipulate subsets of data using Pandas.

---

## 1. Loading the Dataset

In [1]:
import pandas as pd

# Load the employee dataset
df = pd.read_csv("employee_records.csv")

# Display first few rows
df.head()

,Employee_ID,Name,Age,Department,Salary,Experience_Years,Full_Time,Joining_Date,Performance_Rating
0,1001,Alice Johnson,29,IT,70000,5,True,2010-01-01,3
1,1002,Bob Smith,35,HR,55000,7,True,2011-01-01,4
2,1003,Charlie Brown,42,Finance,80000,15,True,2012-01-01,5
3,1004,David Wilson,30,IT,72000,6,False,2012-12-31,3
4,1005,Eva Adams,28,Marketing,50000,3,True,2013-12-31,2

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Employee_ID         20 non-null     int64
 1   Name                20 non-null     object
 2   Age                 20 non-null     int64
 3   Department          20 non-null     object
 4   Salary              20 non-null     int64
 5   Experience_Years    20 non-null     int64
 6   Full_Time           20 non-null     bool
 7   Joining_Date        20 non-null     object
 8   Performance_Rating  20 non-null     int64
dtypes: bool(1), int64(5), object(3)
memory usage: 1.4+ KB

In [4]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Employee_ID,20.0,1010.50,5.916080,1001.0,1005.75,1010.5,1015.25,1020.0
Age,20.0,35.65,7.043287,26.0,29.75,34.5,40.25,50.0
Salary,20.0,66250.00,13005.565610,49000.0,53750.00,70500.0,77000.00,85000.0
Experience_Years,20.0,8.35,5.244295,2.0,4.75,7.0,11.25,20.0
Performance_Rating,20.0,3.50,1.051315,2.0,3.00,3.5,4.00,5.0

## 2. Selecting Columns and Rows

In [6]:
df.columns

Index(['Employee_ID', 'Name', 'Age', 'Department', 'Salary',
       'Experience_Years', 'Full_Time', 'Joining_Date', 'Performance_Rating'],
      dtype='object')

### Selecting Specific Columns

In [8]:
# Selecting single column
df['Name']

0     Alice Johnson
1         Bob Smith
2     Charlie Brown
3      David Wilson
4         Eva Adams
5       Frank White
6        Grace Hall
7       Henry Lewis
8         Ivy Scott
9       Jack Carter
10    Karen Roberts
11         Leo King
12       Mona Lopez
13     Nathan Green
14      Olivia Hill
15      Peter Young
16     Quincy Baker
17     Rachel Allen
18     Steve Martin
19      Tina Turner
Name: Name, dtype: object

In [11]:
cols = ['Name', 'Department', 'Salary']
cols

['Name', 'Department', 'Salary']

In [12]:
# Selecting multiple columns
df[cols].head()

            Name Department  Salary
0  Alice Johnson         IT   70000
1      Bob Smith         HR   55000
2  Charlie Brown    Finance   80000
3   David Wilson         IT   72000
4      Eva Adams  Marketing   50000

### Selecting Rows Using `.loc` and `.iloc`

In [20]:
# Selecting a row by index using loc
df.loc[0]

Employee_ID                    1001
Name                  Alice Johnson
Age                              29
Department                       IT
Salary                        70000
Experience_Years                  5
Full_Time                      True
Joining_Date             2010-01-01
Performance_Rating                3
Name: 0, dtype: object

In [21]:
df.head(2)

,Employee_ID,Name,Age,Department,Salary,Experience_Years,Full_Time,Joining_Date,Performance_Rating
0,1001,Alice Johnson,29,IT,70000,5,True,2010-01-01,3
1,1002,Bob Smith,35,HR,55000,7,True,2011-01-01,4

In [25]:
df.loc[0:5, cols]

            Name Department  Salary
0  Alice Johnson         IT   70000
1      Bob Smith         HR   55000
2  Charlie Brown    Finance   80000
3   David Wilson         IT   72000
4      Eva Adams  Marketing   50000
5    Frank White    Finance   85000

In [26]:
col = [1, 3, 4]

In [31]:
df.iloc[0:6, col]

            Name Department  Salary
0  Alice Johnson         IT   70000
1      Bob Smith         HR   55000
2  Charlie Brown    Finance   80000
3   David Wilson         IT   72000
4      Eva Adams  Marketing   50000
5    Frank White    Finance   85000

In [32]:
df.iloc[0:6,[1,2,4]]

            Name  Age  Salary
0  Alice Johnson   29   70000
1      Bob Smith   35   55000
2  Charlie Brown   42   80000
3   David Wilson   30   72000
4      Eva Adams   28   50000
5    Frank White   50   85000

In [30]:
import numpy as np
df.iloc[0:6, np.r_[1:3, 4:5]]

            Name  Age  Salary
0  Alice Johnson   29   70000
1      Bob Smith   35   55000
2  Charlie Brown   42   80000
3   David Wilson   30   72000
4      Eva Adams   28   50000
5    Frank White   50   85000

In [ ]:
# Selecting specific rows and columns using loc
df.loc[0:5, ['Name', 'Salary']]

# Selecting rows using iloc (position-based)
df.iloc[0:5, 1:4]

## 3. Indexing and Selecting Data

### Using `.at` and `.iat` for Fast Access

In [37]:
# Using .at to access a single value
df.at[0, 'Name']

'Alice Johnson'

In [39]:
# Using .iat to access a single value by index position
df.iat[0, 1]

'Alice Johnson'

In [40]:
# Using .at to access a single value
df.at[0, 'Name']  = 'Solomon Promise'

In [41]:
df.head()

,Employee_ID,Name,Age,Department,Salary,Experience_Years,Full_Time,Joining_Date,Performance_Rating
0,1001,Solomon Promise,29,IT,70000,5,True,2010-01-01,3
1,1002,Bob Smith,35,HR,55000,7,True,2011-01-01,4
2,1003,Charlie Brown,42,Finance,80000,15,True,2012-01-01,5
3,1004,David Wilson,30,IT,72000,6,False,2012-12-31,3
4,1005,Eva Adams,28,Marketing,50000,3,True,2013-12-31,2

## 4. Filtering Data

### Filtering with Boolean Conditions

In [43]:
df.head()

,Employee_ID,Name,Age,Department,Salary,Experience_Years,Full_Time,Joining_Date,Performance_Rating
0,1001,Solomon Promise,29,IT,70000,5,True,2010-01-01,3
1,1002,Bob Smith,35,HR,55000,7,True,2011-01-01,4
2,1003,Charlie Brown,42,Finance,80000,15,True,2012-01-01,5
3,1004,David Wilson,30,IT,72000,6,False,2012-12-31,3
4,1005,Eva Adams,28,Marketing,50000,3,True,2013-12-31,2

In [48]:
IT_dept = df['Department'] == 'IT'

In [55]:
print(df[IT_dept]['Salary'].sum())
print("--------------------------------------")
print(df[IT_dept]['Salary'].mean())

437000
--------------------------------------
72833.33333333333

In [56]:
# Employees in IT department
df[df['Department'] == 'IT']

,Employee_ID,Name,Age,Department,Salary,Experience_Years,Full_Time,Joining_Date,Performance_Rating
0,1001,Solomon Promise,29,IT,70000,5,True,2010-01-01,3
3,1004,David Wilson,30,IT,72000,6,False,2012-12-31,3
7,1008,Henry Lewis,40,IT,76000,12,True,2016-12-30,4
11,1012,Leo King,27,IT,71000,9,False,2020-12-29,4
15,1016,Peter Young,31,IT,73000,8,True,2024-12-28,5
19,1020,Tina Turner,29,IT,75000,7,True,2028-12-27,4

In [62]:
# Employees earning more than 70,000
sal_over_70 = df['Salary'] > 70000
sal_over_70

0     False
1     False
2      True
3      True
4     False
5      True
6     False
7      True
8     False
9      True
10    False
11     True
12    False
13     True
14    False
15     True
16    False
17     True
18    False
19     True
Name: Salary, dtype: bool

In [63]:
coll = ['Department', 'Experience_Years', 'Performance_Rating']

In [67]:
df.loc[sal_over_70, coll]

   Department  Experience_Years  Performance_Rating
2     Finance                15                   5
3          IT                 6                   3
5     Finance                20                   5
7          IT                12                   4
9     Finance                18                   5
11         IT                 9                   4
13    Finance                11                   4
15         IT                 8                   5
17    Finance                14                   4
19         IT                 7                   4

### Filtering with Multiple Conditions

In [69]:
df['Department'] == 'IT'

0      True
1     False
2     False
3      True
4     False
5     False
6     False
7      True
8     False
9     False
10    False
11     True
12    False
13    False
14    False
15     True
16    False
17    False
18    False
19     True
Name: Department, dtype: bool

In [70]:
df['Salary'] > 70000

0     False
1     False
2      True
3      True
4     False
5      True
6     False
7      True
8     False
9      True
10    False
11     True
12    False
13     True
14    False
15     True
16    False
17     True
18    False
19     True
Name: Salary, dtype: bool

In [72]:
(df['Department'] == 'IT') & (df['Salary'] > 70000)

0     False
1     False
2     False
3      True
4     False
5     False
6     False
7      True
8     False
9     False
10    False
11     True
12    False
13    False
14    False
15     True
16    False
17    False
18    False
19     True
dtype: bool

In [74]:
# Employees in IT department earning more than 70,000
df[(df['Department'] == 'IT') & (df['Salary'] > 70000)]

,Employee_ID,Name,Age,Department,Salary,Experience_Years,Full_Time,Joining_Date,Performance_Rating
3,1004,David Wilson,30,IT,72000,6,False,2012-12-31,3
7,1008,Henry Lewis,40,IT,76000,12,True,2016-12-30,4
11,1012,Leo King,27,IT,71000,9,False,2020-12-29,4
15,1016,Peter Young,31,IT,73000,8,True,2024-12-28,5
19,1020,Tina Turner,29,IT,75000,7,True,2028-12-27,4

In [79]:
# Employees in IT department or earning more than 70,000
df.loc[(df['Department'] == 'IT') | (df['Salary'] > 70000), coll]

   Department  Experience_Years  Performance_Rating
0          IT                 5                   3
2     Finance                15                   5
3          IT                 6                   3
5     Finance                20                   5
7          IT                12                   4
9     Finance                18                   5
11         IT                 9                   4
13    Finance                11                   4
15         IT                 8                   5
17    Finance                14                   4
19         IT                 7                   4

### Using `.query()` for Filtering

In [87]:
# Using query to filter data
df.query("Department == 'Finance' and Salary > 75000")[['Name', 'Department', 'Experience_Years']]

             Name Department  Experience_Years
2   Charlie Brown    Finance                15
5     Frank White    Finance                20
9     Jack Carter    Finance                18
13   Nathan Green    Finance                11
17   Rachel Allen    Finance                14

## 5. Filtering Rows and Columns

In [85]:
# Selecting employees with more than 10 years of experience
df[df['Experience_Years'] > 10][['Name', 'Department', 'Experience_Years']]

             Name Department  Experience_Years
2   Charlie Brown    Finance                15
5     Frank White    Finance                20
7     Henry Lewis         IT                12
9     Jack Carter    Finance                18
13   Nathan Green    Finance                11
17   Rachel Allen    Finance                14

In [86]:
# Selecting employees with more than 10 years of experience
df.loc[df['Experience_Years'] > 10, ['Name', 'Department', 'Experience_Years']]

             Name Department  Experience_Years
2   Charlie Brown    Finance                15
5     Frank White    Finance                20
7     Henry Lewis         IT                12
9     Jack Carter    Finance                18
13   Nathan Green    Finance                11
17   Rachel Allen    Finance                14

## 6. Changing Data Types

In [89]:
df.head()

,Employee_ID,Name,Age,Department,Salary,Experience_Years,Full_Time,Joining_Date,Performance_Rating
0,1001,Solomon Promise,29,IT,70000,5,True,2010-01-01,3
1,1002,Bob Smith,35,HR,55000,7,True,2011-01-01,4
2,1003,Charlie Brown,42,Finance,80000,15,True,2012-01-01,5
3,1004,David Wilson,30,IT,72000,6,False,2012-12-31,3
4,1005,Eva Adams,28,Marketing,50000,3,True,2013-12-31,2

In [88]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Employee_ID         20 non-null     int64
 1   Name                20 non-null     object
 2   Age                 20 non-null     int64
 3   Department          20 non-null     object
 4   Salary              20 non-null     int64
 5   Experience_Years    20 non-null     int64
 6   Full_Time           20 non-null     bool
 7   Joining_Date        20 non-null     object
 8   Performance_Rating  20 non-null     int64
dtypes: bool(1), int64(5), object(3)
memory usage: 1.4+ KB

In [91]:
# Converting Salary to float
df['Salary'] = df['Salary'].astype(float)

# Converting Joining_Date to datetime
df['Joining_Date'] = pd.to_datetime(df['Joining_Date'])

# Display updated dtypes
df.dtypes

Employee_ID                    int64
Name                          object
Age                            int64
Department                    object
Salary                       float64
Experience_Years               int64
Full_Time                       bool
Joining_Date          datetime64[ns]
Performance_Rating             int64
dtype: object

In [92]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Employee_ID         20 non-null     int64
 1   Name                20 non-null     object
 2   Age                 20 non-null     int64
 3   Department          20 non-null     object
 4   Salary              20 non-null     float64
 5   Experience_Years    20 non-null     int64
 6   Full_Time           20 non-null     bool
 7   Joining_Date        20 non-null     datetime64[ns]
 8   Performance_Rating  20 non-null     int64
dtypes: bool(1), datetime64[ns](1), float64(1), int64(4), object(2)
memory usage: 1.4+ KB

## 7. Handling Missing Data

### Identifying Missing Values

In [95]:
df.isnull().sum()

Employee_ID           0
Name                  0
Age                   0
Department            0
Salary                0
Experience_Years      0
Full_Time             0
Joining_Date          0
Performance_Rating    0
dtype: int64

In [96]:
df.isna().sum()

Employee_ID           0
Name                  0
Age                   0
Department            0
Salary                0
Experience_Years      0
Full_Time             0
Joining_Date          0
Performance_Rating    0
dtype: int64

In [98]:
# Check for missing values
df.isna().sum()

Employee_ID           0
Name                  0
Age                   0
Department            0
Salary                0
Experience_Years      0
Full_Time             0
Joining_Date          0
Performance_Rating    0
dtype: int64

In [99]:
# Check for missing values
df.isna().mean()*100

Employee_ID           0.0
Name                  0.0
Age                   0.0
Department            0.0
Salary                0.0
Experience_Years      0.0
Full_Time             0.0
Joining_Date          0.0
Performance_Rating    0.0
dtype: float64

### Filling Missing Values

In [100]:
# Fill missing Salary with the mean value
#df['Salary'].fillna(df['Salary'].mean(), inplace=True)

## 8. Removing Duplicates

In [101]:
df.shape

(20, 9)

In [102]:
# Remove duplicate rows
df.drop_duplicates(inplace=True)

In [103]:
df.shape

(20, 9)

## 9. Hands-on Exercises

### Exercise 1: Select Specific Data

1. Select the `Name` and `Department` columns.

2. Select rows where employees are in the `HR` department.

3. Select the first 10 rows using `.iloc`.

### Exercise 2: Filter Data

1. Filter employees who have more than 5 years of experience.

2. Filter employees in the `Marketing` department earning more than 50,000.

### Exercise 3: Change Data Types

1. Convert `Joining_Date` to datetime.

2. Convert `Experience_Years` to float.

### Exercise 4: Handle Missing Data

1. Check for missing values in the dataset.

2. Fill missing values in the `Salary` column with the median salary.

### Exercise 5: Remove Duplicates

1. Check for duplicate rows in the dataset.

2. Remove any duplicate rows and display the updated dataset.

In [104]:
cols=['Name', 'Department']
df[cols]
df[df["Department"] == "HR"]
df.iloc[0:10]

,Employee_ID,Name,Age,Department,Salary,Experience_Years,Full_Time,Joining_Date,Performance_Rating
0,1001,Solomon Promise,29,IT,70000.0,5,True,2010-01-01,3
1,1002,Bob Smith,35,HR,55000.0,7,True,2011-01-01,4
2,1003,Charlie Brown,42,Finance,80000.0,15,True,2012-01-01,5
3,1004,David Wilson,30,IT,72000.0,6,False,2012-12-31,3
4,1005,Eva Adams,28,Marketing,50000.0,3,True,2013-12-31,2
5,1006,Frank White,50,Finance,85000.0,20,True,2014-12-31,5
6,1007,Grace Hall,26,HR,53000.0,2,False,2015-12-31,2
7,1008,Henry Lewis,40,IT,76000.0,12,True,2016-12-30,4
8,1009,Ivy Scott,32,Marketing,51000.0,4,False,2017-12-30,3
9,1010,Jack Carter,38,Finance,83000.0,18,True,2018-12-30,5

In [106]:
# 1. Select the `Name` and `Department` columns
selected_columns = df[["Name", "Department"]]
print("Selected Columns:\n", selected_columns.head())

# 2. Select rows where employees are in the `HR` department
hr_employees = df[df["Department"] == "HR"]
print("\nEmployees in HR Department:\n", hr_employees)

# 3. Select the first 10 rows using `.iloc`
first_10_rows = df.iloc[:10]
print("\nFirst 10 Rows:\n", first_10_rows)

Selected Columns:
               Name Department
0  Solomon Promise         IT
1        Bob Smith         HR
2    Charlie Brown    Finance
3     David Wilson         IT
4        Eva Adams  Marketing

Employees in HR Department:
     Employee_ID           Name  Age Department   Salary  Experience_Years  \
1          1002      Bob Smith   35         HR  55000.0                 7
6          1007     Grace Hall   26         HR  53000.0                 2
10         1011  Karen Roberts   45         HR  54000.0                 5
14         1015    Olivia Hill   36         HR  56000.0                 6
18         1019   Steve Martin   48         HR  57000.0                10

    Full_Time Joining_Date  Performance_Rating
1        True   2011-01-01                   4
6       False   2015-12-31                   2
10       True   2019-12-30                   3
14       True   2023-12-29                   3
18      False   2027-12-28                   3

First 10 Rows:
    Employee_ID             Name  Age Department   Salary  Experience_Years  \
0         1001  Solomon Promise   29         IT  70000.0                 5
1         1002        Bob Smith   35         HR  55000.0                 7
2         1003    Charlie Brown   42    Finance  80000.0                15
3         1004     David Wilson   30         IT  72000.0                 6
4         1005        Eva Adams   28  Marketing  50000.0                 3
5         1006      Frank White   50    Finance  85000.0                20
6         1007       Grace Hall   26         HR  53000.0                 2
7         1008      Henry Lewis   40         IT  76000.0                12
8         1009        Ivy Scott   32  Marketing  51000.0                 4
9         1010      Jack Carter   38    Finance  83000.0                18

   Full_Time Joining_Date  Performance_Rating
0       True   2010-01-01                   3
1       True   2011-01-01                   4
2       True   2012-01-01                   5
3      False   2012-12-31                   3
4       True   2013-12-31                   2
5       True   2014-12-31                   5
6      False   2015-12-31                   2
7       True   2016-12-30                   4
8      False   2017-12-30                   3
9       True   2018-12-30                   5

In [ ]:
import pandas as pd

# Corrected file path with the updated file name
file_path = r"C:\Users\isigh\OneDrive\Documents\purdue\employee_records.csv"

# Try reading the file
try:
    df = pd.read_csv(file_path)
    print("File loaded successfully!\n")
    
    # 1. Select the `Name` and `Department` columns
    selected_columns = df[["Name", "Department"]]
    print("Selected Columns:\n", selected_columns.head())

    # 2. Select rows where employees are in the `HR` department
    hr_employees = df[df["Department"] == "HR"]
    print("\nEmployees in HR Department:\n", hr_employees)

    # 3. Select the first 10 rows using `.iloc`
    first_10_rows = df.iloc[:10]
    print("\nFirst 10 Rows:\n", first_10_rows)